Repository: 04cb/nnabla
Catalog: doc/locale/*/LC_MESSAGES/python/api/ext.po
Languages: ext

source: Extensions
ext: Extension

source: NNabla offers easy extensibility for developers to add new device extensions. The NNabla Python package officially supports the ``cudnn`` extension, which dramatically accelerates computation by leveraging NVIDIA CUDA GPUs with cuDNN computation primitives.
ext: NNabla には、開発者が新規デバイスをかんたんに拡張できる機能があります。NNabla Python パッケージは、公式に ``cudnn`` 拡張機能をサポートしており、cuDNN 計算機プリミティブが備わった NVIDIA CUDA GPU を活用することにより、劇的に計算処理が加速されます。

source: You can manually import extensions by:
ext: 以下のように手動でExtensionをインポートできます:

source: Utilities for extension
ext: Extensionユーティリティ

source: Utilities for NNabla extensions.
ext: NNabla Extensionのためのユーティリティ。

source: List up available extensions.
ext: 利用可能なExtensionをリストアップします。

source: It may not work on some platforms/environments since it depends on the directory structure of the namespace packages.
ext: 名前空間パッケージのディレクトリ構成に依存しているため、あるプラットフォームや環境によっては正しく動作しない可能性があります。

source: Returns: list of str
ext: 戻り値: str のリスト

source: Names of available extensions.
ext: 利用可能なExtension名のリスト。

source: Import an extension module by name.
ext: Extensionモジュールの名称でインポートします。

source: The extension modules are installed under the `nnabla_ext` package as namespace packages. All extension modules provide a unified set of APIs.
ext: Extensionモジュールは、 `nnabla_ext` パッケージの下に名前空間パッケージとしてインストールされます。 すべてのExtensionモジュールは、統一した API セットを提供します。

source: Extension name. e.g. 'cpu', 'cuda', 'cudnn' etc.
ext: Extension名。例: ‘cpu’, ‘cuda’, ‘cudnn’ 等。

source: Returns: module
ext: 戻り値: module

source: An Python module of a particular NNabla extension.
ext: 特定の NNabla Extensionの Python モジュール。

source: Get the context of the specified extension.
ext: 指定されたExtensionのContextを取得します。

source: All extension's module must provide `context(**kw)` function.
ext: すべてのExtensionモジュールは `context(**kw)` 関数を提供する必要があります。

source: Module path relative to `nnabla_ext`.
ext: `nnabla_ext` への相対的なモジュールパス

source: Additional keyword arguments for context function in a extension module.
ext: Extensionモジュールにあるcontext関数への追加のキーワード引数。

source: The current extension context.
ext: 現在のExtensionのcontext

source: APIs of extension modules
ext: Extensionモジュールの API

source: All extension modules must have the following functions.
ext: すべてのExtensionモジュールは以下の関数を持つ必要があります。

source: Returns a default context descriptor of the extension module. This method takes optional arguments depending on the extension. For example, in the ``cudnn`` extension, it takes the ``device_id`` as an ``int`` to specify the GPU where computation runs on.
ext: Extensionモジュールのデフォルトのcontext記述子を返します。本メソッドはExtensionによって異なるオプションとなる引数を取りえます。例えば、 ``cudnn`` Extensionでは、計算処理を実行する GPU を指定するため ``int`` として ``device_id`` を取ります。

source: This method is used to synchronize the device execution stream with respect to the host thread. For example, in CUDA, the kernel execution is enqueued into a stream, and is executed asynchronously w.r.t. the host thread. This function is only valid in devices that use such features. In the CPU implementation, this method is implemented as dummy function, and therefore calls to this function are ignored. The function in the ``cudnn`` extension takes the ``device_id`` as an optional argument, which specifies the device you want to synchronize with.
ext: ホストスレッドに対してデバイス実行ストリームを同期するために本メソッドを使います。例えば CUDA では、カーネル実行をストリームのキューに追加し、ホストスレッドとは非同期に実行します。本関数は、そのような機能を使うデバイス内でのみ有効です。CPU 実装では、本メソッドはダミー関数として実装され、そのため本関数を呼び出しても無視されます。 ``cudnn`` Extensionにある本関数は、オプションの引数として ``device_id`` を取りますが、これによって同期させたいデバイスを指定できます。

source: TODO: Write me.
ext: TODO: 要記入

source: Implementing an extension
ext: Extensionの実装

source: TODO: Link to a page of how to create a new extension.
ext: TODO: how to create a new extension ページへのリンク
